src/Catalogs/Scan_ОпцииПродуктов/Scan_ОпцииПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ОпцииПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БазовыеОпции</name>
      <description>Базовые</description>
    </items>
    <items>
      <name>SOrderОпции</name>
      <description>S-order</description>
    </items>
    <items>
      <name>FFUОпции</name>
      <description>FFU</description>
    </items>
    <items>
      <name>ЛокальныеОпции</name>
      <description>Локальные опции</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяНаРынкеРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяОпция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОпции</name>
    <type>
      <types>CatalogRef.Scan_ТипыОпций</types>
    </type>
  </attributes>
  <attributes>
    <name>RefCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникRefCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукта</name>
    <type>
      <types>CatalogRef.Scan_ВидыПродуктов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ТипыОпций/Scan_ТипыОпций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ТипыОпций</name>
  <predefined>
    <items>
      <name>FFUОпции</name>
      <description>FFU</description>
    </items>
    <items>
      <name>SOrderОпции</name>
      <description>S-order</description>
    </items>
    <items>
      <name>БазовыеОпции</name>
      <description>Базовые</description>
    </items>
    <items>
      <name>ЛокальныеОпции</name>
      <description>Локальные</description>
    </items>
    <items>
      <name>ОпцииНадстроек</name>
      <description>Опции надстройки</description>
    </items>
    <items>
      <name>ОпцииОборудования</name>
      <description>Опции оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ОпцииПродуктов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") тогда //rarus BProg_Gladkov 11.12.2019 0014560 +-
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ЗначениеЗаполнено(ТипОпции) тогда 
			Родитель = Справочники.Scan_ОпцииПродуктов.СемействоОпцииПоТипуОпции(ТипОпции);
		ИначеЕсли ЗначениеЗаполнено(Родитель) тогда
			ТипОпции = Справочники.Scan_ОпцииПродуктов.ТипОпцииПоСемействуОпции(Родитель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда //rarus bonmak 19.12.2019 15532
		Если  ТипОпции <> Справочники.Scan_ТипыОпций.БазовыеОпции //rarus bonmak 19.12.2019 15532 
			И ТипОпции <> Справочники.Scan_ТипыОпций.ЛокальныеОпции //rarus agar 24.07.2020 16123 +-
			Тогда
			Если Родитель <> Справочники.Scan_ОпцииПродуктов.СемействоОпцииПоТипуОпции(ТипОпции) тогда //rarus BProg_Gladkov 11.12.2019 0014560 +-
				ТекстСообщения = НСтр("ru = 'Семейство опций не соответствует типу опции.'; 
				|en = 'The family name does not match the option type.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "Родитель", , Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
